# 1.read the dataset from sys to environment

In [148]:
import pandas as pd
df=pd.read_csv("C:\\Users\\kondu\\Downloads\\Sf_Salaries.csv")
df

C:\Users\kondu\AppData\Local\Temp\ipykernel_22744\1227556590.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("C:\\Users\\kondu\\Downloads\\Sf_Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# 2.Find the information

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [150]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

# 3. what is average on base pay

In [151]:
data=df.groupby("BasePay").mean()

In [152]:
data

                     Id  TotalPay  TotalPayBenefits    Year  Notes
BasePay
-166.01        72833.00     83.01             89.57  2012.0    NaN
-121.63        72866.00     61.07             66.51  2012.0    NaN
-109.22        72873.00     54.61             58.93  2012.0    NaN
-106.6         72875.00     53.30             57.96  2012.0    NaN
-101.88        72879.00     51.20             55.75  2012.0    NaN
...                 ...       ...               ...     ...    ...
9991.53       142974.00   9991.53          14008.74  2014.0    NaN
9997.15       143970.00  10318.22          10421.40  2014.0    NaN
9998.60       142583.00   9998.60          15824.17  2014.0    NaN
9999.59       144091.00   9999.59           9999.59  2014.0    NaN
Not Provided  148650.75      0.00              0.00  2014.0    NaN

[109900 rows x 5 columns]

# 4.what is the highest amount of OvertimePay in dataset

In [153]:
df["OvertimePay"]=pd.to_numeric(df["OvertimePay"], errors='coerce')
high_amount_overTime=df["OvertimePay"].max()
high_amount_overTime

245131.88

In [154]:
df["OvertimePay"].sort_values(ascending=False)

1         245131.88
36159     220909.48
72964     196689.18
36163     192424.49
110574    173547.73
            ...
90714         -0.01
148646          NaN
148650          NaN
148651          NaN
148652          NaN
Name: OvertimePay, Length: 148654, dtype: float64

# 5. what is the jobtitle of JOSEPH DRISCOLL

In [155]:
df[df["EmployeeName"]=="JOSEPH DRISCOLL"]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

# 6.How much does JOSEPH DRISCOLL make(Including benefits)

In [157]:
df[df["EmployeeName"]=="JOSEPH DRISCOLL"][["EmployeeName",'TotalPayBenefits']]

       EmployeeName  TotalPayBenefits
24  JOSEPH DRISCOLL         270324.91

# 7. what is the name of the highest paid person(Including benefits)

In [158]:
df["TotalPayBenefits"].idxmax()

0

In [159]:
df["TotalPayBenefits"][df["TotalPayBenefits"].idxmax()]

567595.43

In [160]:
df.iloc[0][1]

'NATHANIEL FORD'

# 8. what is the name of the lowest paid person(Including benefits)

In [161]:
df["TotalPayBenefits"].idxmin()

148653

In [162]:
df["TotalPayBenefits"][df["TotalPayBenefits"].idxmin()]

-618.13

In [163]:
df.iloc[148653][1]

'Joe Lopez'

# 9. how many unique job titlrs are there

In [164]:
n_jobtitle=df["JobTitle"].nunique()

In [165]:
n_jobtitle

2159

# 9. what are the top 5 most common jobs

In [166]:
df["JobTitle"].value_counts().sort_values(ascending=False).head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

# 10. what was the average(mean) Basepay of all employees per year(2011-2014)

In [167]:
data1=df[df["Year"]==2011][["Year","BasePay","EmployeeName"]]
print(data1)
df1=data1.groupby("BasePay").mean()
df1 #average basepay for year 2011

       Year    BasePay        EmployeeName
0      2011  167411.18      NATHANIEL FORD
1      2011  155966.02        GARY JIMENEZ
2      2011  212739.13      ALBERT PARDINI
3      2011    77916.0   CHRISTOPHER CHONG
4      2011   134401.6     PATRICK GARDNER
...     ...        ...                 ...
36154  2011        0.0       SERENA HUGHES
36155  2011        0.0        JOE BROWN JR
36156  2011        0.0      PAULETTE ADAMS
36157  2011        0.0       KAUKAB MOHSIN
36158  2011        0.0  JOSEPHINE MCCREARY

[36159 rows x 3 columns]

             Year
BasePay
0.00       2011.0
14.25      2011.0
17.48      2011.0
27.28      2011.0
27.63      2011.0
...           ...
261717.60  2011.0
268604.57  2011.0
271329.03  2011.0
285262.00  2011.0
294580.02  2011.0

[27392 rows x 1 columns]

In [168]:
year_2012=df[df["Year"]==2012][["Year","BasePay","EmployeeName"]]
print(year_2012)
year_2012.groupby("BasePay").mean()#average basepay for year 2012

       Year    BasePay        EmployeeName
36159  2012  128808.87      Gary Altenberg
36160  2012   302578.0        Gregory Suhr
36161  2012   111921.0          Khoa Trinh
36162  2012  296943.01  Joanne Hayes-White
36163  2012  126863.19   Frederick Binkley
...     ...        ...                 ...
72920  2012     -30.58    Charles Williams
72921  2012        0.0        John Carajan
72922  2012       -9.5         John Draper
72923  2012        0.0        Cherise Wong
72924  2012        0.0        Donald Clark

[36766 rows x 3 columns]

              Year
BasePay
-166.01     2012.0
-121.63     2012.0
-109.22     2012.0
-106.60     2012.0
-101.88     2012.0
...            ...
 271607.74  2012.0
 287747.89  2012.0
 294000.17  2012.0
 296943.01  2012.0
 302578.00  2012.0

[28078 rows x 1 columns]

In [169]:
year_2013=df[df["Year"]==2013][["Year","BasePay","EmployeeName"]]
print(year_2013)
year_2013.groupby("BasePay").mean()#average basepay for year 2013

        Year    BasePay          EmployeeName
72925   2013  319275.01        Gregory P Suhr
72926   2013  313686.01  Joanne M Hayes-White
72927   2013  186236.42           Samson  Lai
72928   2013  272855.51       Ellen G Moffatt
72929   2013  315572.01         Robert L Shaw
...      ...        ...                   ...
110526  2013        NaN        Arthur L Curry
110527  2013        NaN         Nereida  Vega
110528  2013        NaN      Timothy E Gibson
110529  2013        NaN        Mark E Laherty
110530  2013        NaN         David P Kucia

[37606 rows x 3 columns]

             Year
BasePay
15.83      2013.0
18.81      2013.0
25.00      2013.0
26.34      2013.0
29.23      2013.0
...           ...
311758.96  2013.0
313312.52  2013.0
313686.01  2013.0
315572.01  2013.0
319275.01  2013.0

[26979 rows x 1 columns]

In [171]:
year_2014=df[df["Year"]==2014][["Year","BasePay","EmployeeName"]]
print(year_2014)
year_2014.groupby("BasePay").mean()#average basepay for year 2014

        Year       BasePay          EmployeeName
110531  2014     129150.01           David Shinn
110532  2014     318835.49            Amy P Hart
110533  2014      257340.0  William J Coaker Jr.
110534  2014     307450.04        Gregory P Suhr
110535  2014      302068.0  Joanne M Hayes-White
...      ...           ...                   ...
148649  2014          0.00         Roy I Tillery
148650  2014  Not Provided          Not provided
148651  2014  Not Provided          Not provided
148652  2014  Not Provided          Not provided
148653  2014          0.00             Joe Lopez

[38123 rows x 3 columns]

                Year
BasePay
0.0           2014.0
3031.01       2014.0
4115.72       2014.0
7660.0        2014.0
9650.2        2014.0
...              ...
9991.53       2014.0
9997.15       2014.0
9998.60       2014.0
9999.59       2014.0
Not Provided  2014.0

[28274 rows x 1 columns]